{
  "backend/main.mo": "Actor canister initializing access control and defining maps and types for users, posts, interactions, and media-related entities.",
  "feature_evidence.json": "Feature evidence report detailing navigation changes, file impacts, related components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality and behavior of multiple frontend components and hooks.",
  "frontend/index.html": "Base HTML file setting metadata, favicon, theme color, and mounting root for the frontend app.",
  "frontend/public/manifest.json": "Web app manifest defining app name, icons, colors, and standalone display settings.",
  "frontend/public/sw.js": "Service worker implementing caching strategy with versioned caches, navigation handling, asset caching, and update lifecycle events.",
  "frontend/src/App.tsx": "Main React app setup with routing, providers, layout logic, and full-screen reel behavior on the root route.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard that verifies admin status and displays tabs for system tools like service status and storage cleanup.",
  "frontend/src/components/AllInOneHub.tsx": "Navigation hub showing cards that link to major app sections such as home, discover, messages, and marketplace.",
  "frontend/src/components/AnimatedDeedsBar.tsx": "Animated canvas-based progress bar that tracks session and daily usage, issuing warnings and timeouts.",
  "frontend/src/components/AnimatedLogo.tsx": "Empty placeholder component.",
  "frontend/src/components/AnimatedStars.tsx": "Empty placeholder component.",
  "frontend/src/components/BlogCard.tsx": "Displays a blog post with author info, media tags, timestamps, and modal profile viewing.",
  "frontend/src/components/BlogPage.tsx": "Page that lists blogs, supports creating new posts, and shows skeletons or empty-state messaging.",
  "frontend/src/components/ChallengesSection.tsx": "Challenge system UI with weekly challenges, join/share actions, leaderboards, and user badge displays.",
  "frontend/src/components/CommentsSection.tsx": "Renders a comment input form and displays sorted comments with author info and timestamps, though comment creation is not yet implemented.",
  "frontend/src/components/CreateBlogButton.tsx": "Shows a button that opens the CreateBlogModal dialog for creating a new blog post.",
  "frontend/src/components/CreateBlogModal.tsx": "Provides a form for creating a blog with text, categories, tags, media uploads, and live toggle, handling validation and submission via useCreateBlog.",
  "frontend/src/components/CreateMarketplacePostModal.tsx": "Modal for creating marketplace posts with fields for details, category, media upload, and post type, submitting through useCreateMarketplacePost.",
  "frontend/src/components/CreatePostButton.tsx": "Displays a styled button that opens the CreatePostModal to share a new post.",
  "frontend/src/components/CreatePostModal.tsx": "Form modal to create a post with caption, category, optional photo or video, media filters, and submission via useCreatePost.",
  "frontend/src/components/DeedsBar.tsx": "Visual timer bar showing session and daily usage with warnings, timeout triggers, and battery-style indicators.",
  "frontend/src/components/DiscoverFeed.tsx": "Displays a discover feed with filters for trending, videos, photos, and for-you posts, including video mode and horizontal scroll behavior.",
  "frontend/src/components/Feed.tsx": "Shows the main feed with post filters, sorting by timestamp, video mode support, and a create-post option when authenticated.",
  "frontend/src/components/FollowersModal.tsx": "Modal listing a user's followers with profile previews and loading states.",
  "frontend/src/components/FollowingModal.tsx": "Modal showing accounts a user follows, including profile details and loading feedback.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/FriendsStatusFeed.tsx": "Fetches and displays recent status updates from followed users with timestamps and placeholders.",
  "frontend/src/components/Gate.tsx": "Landing page featuring search, trending blogs, user interaction, and various content sections like challenges and status feeds.",
  "frontend/src/components/GradeDeedsRating.tsx": "Displays a user's rating report card with mock rating data and allows friends to submit new ratings via a modal. Includes color-coded metrics, sliders, and toast feedback.",
  "frontend/src/components/Header.tsx": "Renders the site header with logo navigation, language selector, messaging shortcut, and login/logout handling using Internet Identity. Manages authentication state and routing.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a modal-based language picker with flag icons, updating the app's language context. Opens via a globe button and closes on selection.",
  "frontend/src/components/LiveChatPanel.tsx": "Implements a live chat interface for a session with auto-scrolling, message sending, and user avatars. Fetches live comments and user profiles via queries.",
  "frontend/src/components/LiveFeed.tsx": "Shows active live sessions, allows starting a new live stream, and opens a viewer for selected sessions. Displays loading, empty state, and session cards with broadcaster info.",
  "frontend/src/components/LiveViewerModal.tsx": "Displays a modal viewer for a live session with a simulated video preview and integrated live chat panel. Shows viewer count and closes through dialog controls.",
  "frontend/src/components/LoginPrompt.tsx": "Login screen component that triggers Internet Identity login and displays promotional UI elements with loading state handling.",
  "frontend/src/components/LogoShowcase.tsx": "Empty file with no implemented component.",
  "frontend/src/components/Marketplace.tsx": "Main marketplace view that fetches posts, filters and sorts them, and provides UI for creating new posts.",
  "frontend/src/components/MarketplaceCard.tsx": "Card component displaying a single marketplace post with author info, category labels, timestamps, and basic save/message actions.",
  "frontend/src/components/Messages.tsx": "Messaging interface allowing users to select followed users and send text messages through backend hooks.",
  "frontend/src/components/ModerationWarningBanner.tsx": "Banner component showing a styled moderation warning with icon and alert styling.",
  "frontend/src/components/NotificationsPanel.tsx": "Dialog panel displaying sorted notifications with timestamps and per-item mark-as-read actions.",
  "frontend/src/components/PhotoTextReelCard.tsx": "Displays a fullscreen reel-style post with blurred background, author info, photo, caption, category, and an action overlay.",
  "frontend/src/components/PostCard.tsx": "Renders a feed-style post card with author details, category, media, reactions, and moderation warnings.",
  "frontend/src/components/Profile.tsx": "Implements the user profile page with posts, followers, notifications, profile editing, and session tracking.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup including name, bio, and optional profile picture upload.",
  "frontend/src/components/ReactionButtons.tsx": "Provides spark, inspire, comment, and share reaction buttons with toast feedback and comment toggling.",
  "frontend/src/components/ReelActionOverlay.tsx": "Floating action buttons for reel posts enabling spark, inspire, comment, and share interactions.",
  "frontend/src/components/ReelBottomNav.tsx": "Deprecated bottom navigation bar for reel pages with buttons for main app sections and a create-post modal trigger.",
  "frontend/src/components/ReelBottomTabNav.tsx": "Enhanced bottom tab navigation with active states, labels, keyboard access, and a create-post modal.",
  "frontend/src/components/ReelHome.tsx": "Main reel feed displaying posts vertically with scroll snapping, authentication checks, and autoplay logic.",
  "frontend/src/components/SafeImageIcon.tsx": "Image component that falls back to an icon or text when loading fails.",
  "frontend/src/components/Search.tsx": "Search bar component with input, submit button, and callback for performing searches.",
  "frontend/src/components/SearchWithSi.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/ServiceStatusChecker.tsx": "Checks backend health status, displays results with icons and badges, and handles admin-only errors.",
  "frontend/src/components/SiAssistant.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/SkeletonBlog.tsx": "Skeleton loading placeholder for a blog card layout.",
  "frontend/src/components/SkeletonMarketplace.tsx": "Skeleton loader representing a marketplace item card with images and metadata.",
  "frontend/src/components/SkeletonPost.tsx": "Skeleton loading UI for a standard post card with header, content, and actions.",
  "frontend/src/components/Space.tsx": "Static page describing a cosmic-themed UI with info cards about features and customization.",
  "frontend/src/components/SpaceStarfield.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/SpaceThemeSettings.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/StarEffectLogo.tsx": "Canvas-based animated star particle effect rendered around an image logo using rotating and twinkling particles.",
  "frontend/src/components/StarlightBackground.tsx": "File is empty or contains no content.",
  "frontend/src/components/StartLiveModal.tsx": "Modal for starting and ending live video sessions with camera/audio controls and live chat panel integration.",
  "frontend/src/components/StartupRecoveryScreen.tsx": "Recovery screen that explains cache issues and triggers a full app cache clear and reload.",
  "frontend/src/components/StorageCleanup.tsx": "Interface for running health checks and deep cleanup of blob storage with progress tracking and status reporting.",
  "frontend/src/components/TalkToMeBar.tsx": "File is empty or contains no content.",
  "frontend/src/components/TopLevelErrorBoundary.tsx": "Error boundary that catches top-level app errors and displays a reload prompt with error details.",
  "frontend/src/components/TrendingSidebar.tsx": "Sidebar showing trending hashtags and top users derived from recent posts.",
  "frontend/src/components/UpdateAvailableBanner.tsx": "Banner component that prompts users to apply updates or perform a full cache recovery, handling blocked reloads and update progress state.",
  "frontend/src/components/UpdateStatusModal.tsx": "Modal for updating a user's status text, image, and optional music attachment with upload handling and validation.",
  "frontend/src/components/UserProfileModal.tsx": "Modal displaying another user's profile, posts, and follow stats, with loading states and optional follow action placeholder.",
  "frontend/src/components/VideoModeReel.tsx": "Full‑screen vertical reel viewer that scroll-snaps through posts and activates the current video based on scroll position.",
  "frontend/src/components/VideoReelCard.tsx": "Card for displaying a single video post with auto-play, mute controls, author info, timestamps, and moderation warnings.",
  "frontend/src/components/WeatherBackground.tsx": "Canvas-based animated weather background rendering rain or snow particles with adaptive gradients based on weather and time.",
  "frontend/src/components/WheelNavScroller.tsx": "Empty file with no implementation.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a language context with translation dictionaries and a hook to access and change the current UI language.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useHorizontalWheelScroll.ts": "Converts vertical mouse wheel movement into horizontal scrolling for a referenced element unless interacting with clickable elements.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity persistence via context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, albums, statuses, music attachments, and related backend data.",
  "frontend/src/hooks/useServiceWorkerUpdate.ts": "Detects service worker updates, handles stale caches, and controls when to activate updates or reload with a reload guard.",
  "frontend/src/hooks/useSpaceTheme.ts": "Empty placeholder hook with no implementation.",
  "frontend/src/hooks/useWeather.ts": "Fetches weather and sun cycle data using geolocation and OpenMeteo, with fallbacks and periodic updates.",
  "frontend/src/hooks/useWheelScroller.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, and custom utility classes for scrolling, shadows, and bottom navigation UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react-query and Internet Identity providers.",
  "frontend/src/utils/swRecovery.ts": "Implements functions to clear caches, unregister service workers, manage cooldowns, and perform full client-side recovery flows.",
  "frontend/src/utils/swReloadGuard.ts": "Tracks and limits service‑worker‑triggered reloads using sessionStorage to prevent reload loops.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, container settings, and plugins like typography and animations.",
  "project_state.json": "Stores project metadata, including requirements to replace wheel navigation with a new mechanic and track feature requests."
}