{
  "backend/main.mo": "Actor providing access control initialization and queries plus large in‑memory maps for user profiles, posts, comments, messaging, live sessions, blogs, marketplace posts, albums, and achievement data.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend React components, hooks, and styles.",
  "frontend/index.html": "Base HTML document setting metadata, favicon, root mount node, and loading the React entry script.",
  "frontend/public/manifest.json": "PWA manifest defining app name, theme colors, start URL, and app icons.",
  "frontend/public/sw.js": "Service worker implementing navigation caching, asset caching, versioned cache management, and network‑first strategies.",
  "frontend/src/App.tsx": "Main React app with router setup, providers, service‑worker recovery, global layout, and routes for all major screens including the All‑in‑One Hub.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard that checks admin status and shows management tabs like service status and storage cleanup.",
  "frontend/src/components/AllInOneHub.tsx": "Central navigation hub displaying main app sections and actions with auth-gated options and a create-post modal.",
  "frontend/src/components/AnimatedDeedsBar.tsx": "Animated canvas-based progress bar that shows session and daily usage limits with warnings and timeouts.",
  "frontend/src/components/AnimatedLogo.tsx": "Empty placeholder component file.",
  "frontend/src/components/AnimatedStars.tsx": "Empty placeholder component file.",
  "frontend/src/components/BlogCard.tsx": "Renders an individual blog card with author info, media badges, truncated content, and profile modal support.",
  "frontend/src/components/BlogPage.tsx": "Blog listing page that loads, sorts, and displays blogs with a create-blog modal and loading skeletons.",
  "frontend/src/components/ChallengesSection.tsx": "Challenge system UI with weekly challenges, joining, sharing, leaderboards, badges, and progress dialogs.",
  "frontend/src/components/CommentsSection.tsx": "Renders a comment form and list with sorting, loading states, and user profile lookups; submission is stubbed with a placeholder toast.",
  "frontend/src/components/CreateBlogButton.tsx": "Shows a button that opens a modal for creating a blog post.",
  "frontend/src/components/CreateBlogModal.tsx": "Modal for creating a blog with text, categories, tags, media upload previews, and form validation before calling the createBlog mutation.",
  "frontend/src/components/CreateMarketplacePostModal.tsx": "Modal to create a marketplace post with required fields, category and type selection, optional media upload, and submission to the backend.",
  "frontend/src/components/CreatePostButton.tsx": "Displays a stylized button that opens the CreatePostModal for sharing a new post.",
  "frontend/src/components/CreatePostModal.tsx": "Modal for creating a post with caption, category, optional photo or video upload, filters, and submission handling.",
  "frontend/src/components/DeedsBar.tsx": "Displays session and daily usage timers with battery-style indicators and triggers warnings or timeout callbacks.",
  "frontend/src/components/DiscoverFeed.tsx": "Displays a discover page with filterable post feed and video mode, fetching and sorting posts based on selected criteria.",
  "frontend/src/components/Feed.tsx": "Renders the main feed with filters for content types, sorting posts by timestamp, and supports a video-only viewing mode.",
  "frontend/src/components/FollowersModal.tsx": "Shows a modal listing a user's followers with profile previews, loading states, and scrollable content.",
  "frontend/src/components/FollowingModal.tsx": "Shows a modal listing accounts the user follows with profile details and loading handling.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying credits and a link to caffeine.ai.",
  "frontend/src/components/FriendsStatusFeed.tsx": "Displays recent status updates from followed users with timestamps, loading skeletons, and empty-state messaging.",
  "frontend/src/components/Gate.tsx": "Landing page combining search, trending blogs, challenges, friend status feed, and introductory content for the app.",
  "frontend/src/components/GradeDeedsRating.tsx": "Displays a detailed rating card with mock data and allows authenticated friends to submit ratings via a modal.",
  "frontend/src/components/Header.tsx": "Header bar handling login/logout, navigation, language selection, and optional messages button.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dialog-based language picker allowing users to switch among predefined languages.",
  "frontend/src/components/LiveChatPanel.tsx": "Live chat interface that loads comments, auto-scrolls, and lets users post new messages; includes comment item rendering.",
  "frontend/src/components/LiveFeed.tsx": "Lists active live sessions, supports starting a new session, and opens viewer modals for selected streams.",
  "frontend/src/components/LiveViewerModal.tsx": "Modal viewer showing a placeholder live stream with viewer count and an embedded live chat panel.",
  "frontend/src/components/LoginPrompt.tsx": "Login screen that triggers Internet Identity login and displays a branded welcome card with feature highlights.",
  "frontend/src/components/LogoShowcase.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/Marketplace.tsx": "Marketplace page showing posts with filtering, sorting, tabs, and a modal to create new posts using data from useGetAllMarketplacePosts.",
  "frontend/src/components/MarketplaceCard.tsx": "Card component rendering a marketplace post with author info, category, timestamp, and actions such as save and message.",
  "frontend/src/components/Messages.tsx": "Messaging interface listing followed users, allowing selecting a conversation target and sending messages via useSendMessage.",
  "frontend/src/components/ModerationWarningBanner.tsx": "Small alert banner reminding users to keep content positive, styled with warning visuals.",
  "frontend/src/components/NotificationsPanel.tsx": "Modal listing notifications with timestamps and a button to mark each as read using useMarkNotificationRead.",
  "frontend/src/components/PostCard.tsx": "Renders a detailed post card with author info, category badges, timestamps, moderation banner, and reaction buttons. Fetches profile data and manages profile modal state.",
  "frontend/src/components/Profile.tsx": "Displays the logged-in user's profile, posts, albums, notifications, and allows updating profile and images. Manages modal visibility and session activity tracking.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup including name, bio, and optional profile picture upload. Saves the profile and blocks closing until completion.",
  "frontend/src/components/ReactionButtons.tsx": "Provides spark, inspire, share, and comment actions for a post with animations and toast feedback. Handles like mutation and comment section toggling.",
  "frontend/src/components/SafeImageIcon.tsx": "Image component that falls back to an icon and optional text when the image fails to load. Tracks load errors with internal state.",
  "frontend/src/components/Search.tsx": "Search bar component with input and submit button that triggers a callback with the entered term. Includes styling and icon integration.",
  "frontend/src/components/SearchWithSi.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/ServiceStatusChecker.tsx": "Checks backend health via an admin-only API and displays operational status with icons and badges. Handles loading, success, and error states with toast notifications.",
  "frontend/src/components/SiAssistant.tsx": "Empty file with no implemented component.",
  "frontend/src/components/SkeletonBlog.tsx": "Renders a skeleton placeholder for a blog card with avatar, text lines, images, and footer buttons.",
  "frontend/src/components/SkeletonMarketplace.tsx": "Displays a detailed skeleton loader for a marketplace item card with header, content blocks, image, and footer buttons.",
  "frontend/src/components/SkeletonPost.tsx": "Shows a skeleton placeholder for a post with user info, text lines, an image area, and action buttons.",
  "frontend/src/components/Space.tsx": "Static page presenting information cards about a space-themed environment and customization options.",
  "frontend/src/components/SpaceStarfield.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/SpaceThemeSettings.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/StarEffectLogo.tsx": "Canvas-based animated star effect around an image logo using rotating, twinkling particle rendering.",
  "frontend/src/components/StarlightBackground.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/StartLiveModal.tsx": "Modal for starting and ending live video sessions, managing camera/audio streams, and showing live UI state.",
  "frontend/src/components/StartupRecoveryScreen.tsx": "Displays a recovery screen for clearing cache and handling startup issues with user guidance.",
  "frontend/src/components/StorageCleanup.tsx": "Provides UI for storage health checks and deep cleanup operations with progress and result handling.",
  "frontend/src/components/TalkToMeBar.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/TopLevelErrorBoundary.tsx": "Error boundary component showing a fallback UI and reload option when an unhandled error occurs.",
  "frontend/src/components/TrendingSidebar.tsx": "Displays trending hashtags and top users by analyzing all posts, computing hashtag frequency and user post counts.",
  "frontend/src/components/UpdateAvailableBanner.tsx": "Shows a banner when a new app version is available, handling update attempts and fallback cache‑clearing recovery.",
  "frontend/src/components/UpdateStatusModal.tsx": "Modal for editing user status text, uploading images and music, and saving updates to the user profile.",
  "frontend/src/components/UserProfileModal.tsx": "Displays a user's profile, posts, and basic stats with follow button placeholder logic and profile modal layout.",
  "frontend/src/components/VideoModeReel.tsx": "Full-screen vertical scrolling video viewer that snaps between posts and auto‑activates the current video.",
  "frontend/src/components/VideoReelCard.tsx": "Renders an individual post's video with play, mute, author info, and timestamp logic, supporting video‑mode auto‑play.",
  "frontend/src/components/WeatherBackground.tsx": "Renders a canvas‑based animated weather background with particles and dynamic gradients based on weather and time of day.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a language context with translation dictionaries and helpers for switching and retrieving localized strings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useHorizontalWheelScroll.ts": "Converts vertical mouse wheel movement into horizontal scrolling for a given element when appropriate.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading stored identities and providing login and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines data‑fetching and mutation hooks for profiles, albums, status updates, and music attachments using the backend actor.",
  "frontend/src/hooks/useServiceWorkerUpdate.ts": "Detects service worker updates, handles stale cache checks, and provides a method to activate waiting workers with reload guarding.",
  "frontend/src/hooks/useSpaceTheme.ts": "Placeholder file; currently contains no implementation.",
  "frontend/src/hooks/useWeather.ts": "Custom hook that fetches geolocation-based weather data from OpenMeteo, maps weather codes, and updates day/night state with fallbacks.",
  "frontend/src/index.css": "Defines Tailwind layers and a full OKLCH color system with light/dark mode variables, utilities, and animations.",
  "frontend/src/main.tsx": "Entry point that mounts the app with React Query and Internet Identity provider.",
  "frontend/src/utils/swRecovery.ts": "Provides utilities to clear caches, unregister service workers, manage recovery cooldowns, and trigger full SW recovery.",
  "frontend/src/utils/swReloadGuard.ts": "Implements session-based counters to limit and block excessive service-worker-triggered reloads.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters from query strings and hash routes.",
  "frontend/tailwind.config.js": "Tailwind config that enables dark mode, loads plugins, and maps CSS variables to theme colors, radii, and shadows.",
  "project_state.json": "Stores the current project state with focus on restoring missing icons, building a unified scrollable hub screen, and improving video-mode transitions. Includes existing features, new feature requests, known issues, and project metadata."
}