{
  "backend/main.mo": "Defines the main canister with access control, blob storage mixin, and large maps for user, post, messaging, live session, marketplace, and media-related data types.",
  "feature_evidence.json": "Feature evidence report mapping app features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose, styling, and feature integrations.",
  "frontend/index.html": "Main HTML entrypoint that loads the React app and sets metadata, favicon, and root mounting point.",
  "frontend/public/manifest.json": "Web app manifest defining PWA metadata such as name, icons, colors, and start behavior.",
  "frontend/public/sw.js": "Service worker implementing cache management, update handling, navigation fallback, and selective asset caching.",
  "frontend/src/App.tsx": "Main React app initialization with routing, providers, recovery logic, and layout including header, footer, and bottom navigation.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard that checks admin status and shows tabs for system tools like service status and storage cleanup.",
  "frontend/src/components/AllInOneHub.tsx": "Central navigation hub presenting feature shortcuts and a control to reset video layout preferences.",
  "frontend/src/components/AnimatedDeedsBar.tsx": "Animated canvas-based progress bar reacting to session duration and daily usage with warning and timeout callbacks.",
  "frontend/src/components/AnimatedLogo.tsx": "Empty placeholder component file for an animated logo.",
  "frontend/src/components/AnimatedStars.tsx": "Empty placeholder component file for an animated star effect.",
  "frontend/src/components/BlogCard.tsx": "Displays an individual blog post with author info, media indicators, truncated content, and a profile modal.",
  "frontend/src/components/BlogPage.tsx": "Renders the blog list with sorting, loading states, empty state messaging, and a modal to create new blogs.",
  "frontend/src/components/ChallengesSection.tsx": "Shows weekly challenges, joining and sharing actions, mock leaderboard, and user badges with UI dialogs.",
  "frontend/src/components/CommentsSection.tsx": "Renders a comment input form and a list of sorted comments with avatars and timestamps. Comment submission is stubbed with a toast notification.",
  "frontend/src/components/CreateBlogButton.tsx": "Provides a button that toggles the visibility of the CreateBlogModal. Used to start creating a new blog post.",
  "frontend/src/components/CreateBlogModal.tsx": "Modal for creating blog posts with title, content, categories, tags, media uploads, and live toggle. Handles media previews, size checks, upload progress, and blog submission.",
  "frontend/src/components/CreateMarketplacePostModal.tsx": "Modal for creating marketplace posts with fields for details, category, post type, and an optional media upload. Validates inputs, handles media processing, and submits the post.",
  "frontend/src/components/CreatePostButton.tsx": "Button that opens the CreatePostModal for sharing a good deed post. Includes styled presentation and modal toggle behavior.",
  "frontend/src/components/CreatePostModal.tsx": "Modal for creating posts with caption, category, optional image or video, and visual adjustments. Handles media validation, previews, upload progress, and post submission.",
  "frontend/src/components/DeedsBar.tsx": "Displays session and daily usage timers with battery-style indicators and warnings. Triggers callbacks when nearing or reaching session limits.",
  "frontend/src/components/DiscoverFeed.tsx": "Displays a Discover feed with horizontal filter buttons and sorted, filtered posts including loading and empty states.",
  "frontend/src/components/Feed.tsx": "Renders the main feed with filters, sorting by timestamp, post creation button, and fallbacks for loading or empty lists.",
  "frontend/src/components/FollowersModal.tsx": "Shows a modal listing a user's followers with profile info, loading state, and avatar fallbacks.",
  "frontend/src/components/FollowingModal.tsx": "Shows a modal listing accounts the user follows with profile data and loading handling.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with dynamic year, branding, and a referral link to caffeine.ai.",
  "frontend/src/components/FriendsStatusFeed.tsx": "Displays status updates from followed users with sorting, timestamps, and detailed loading or empty states.",
  "frontend/src/components/Gate.tsx": "Implements the landing page with branding, blog search, trending blogs, and various feature sections, managing search and user selection state.",
  "frontend/src/components/GradeDeedsRating.tsx": "Displays a user’s rating report card with mock data and allows friends to submit ratings via a modal.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, language selector, and login/logout controls using Internet Identity.",
  "frontend/src/components/IconBadge.tsx": "Provides a configurable icon-with-label badge component supporting size and style variants.",
  "frontend/src/components/LanguageSelector.tsx": "Shows a language picker dialog allowing users to switch app languages with flags and selection state.",
  "frontend/src/components/LiveChatPanel.tsx": "Implements live chat for a session, displaying comments and allowing users to send new messages.",
  "frontend/src/components/LiveFeed.tsx": "Lists active live sessions, lets users start a live stream, and open viewer modals for existing streams.",
  "frontend/src/components/LiveViewerModal.tsx": "Displays a modal with a placeholder live video viewer and an integrated chat panel for a selected session.",
  "frontend/src/components/LoginPrompt.tsx": "Login screen using Internet Identity with branding, benefits list, and loading overlay.",
  "frontend/src/components/LogoShowcase.tsx": "Empty placeholder component with no content provided.",
  "frontend/src/components/Marketplace.tsx": "Marketplace view with tabs, sorting, post fetching, and modal for creating new posts.",
  "frontend/src/components/MarketplaceCard.tsx": "Displays a single marketplace post with author info, category, actions, and timestamp formatting.",
  "frontend/src/components/Messages.tsx": "Messaging UI for selecting followed users and sending direct messages.",
  "frontend/src/components/ModerationWarningBanner.tsx": "Displays a styled warning banner encouraging positive behavior.",
  "frontend/src/components/NotificationsPanel.tsx": "Modal listing notifications with sorting, timestamps, and mark-as-read actions.",
  "frontend/src/components/PhotoTextReelCard.tsx": "Displays a full-screen reel-style post with photo, caption, author info, category label, and action overlay, with support for flagged content warnings and profile modal.",
  "frontend/src/components/PostCard.tsx": "Renders a feed-style post card with author info, category tags, media, moderation banner, and reaction buttons.",
  "frontend/src/components/Profile.tsx": "Implements the main user profile page with posts, followers, notifications, profile editing, and media upload handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a modal for initial user profile setup, allowing entry of name, bio, and optional profile picture upload.",
  "frontend/src/components/ReactionButtons.tsx": "Adds spark, inspire, comment, and share interactions to posts, with toast feedback and comment toggling.",
  "frontend/src/components/ReelActionOverlay.tsx": "Shows floating spark, inspire, comment, and share buttons on reel posts, triggering toast responses and like mutations.",
  "frontend/src/components/ReelBottomNav.tsx": "Deprecated bottom navigation bar rendering icons and routing actions, with a modal trigger for creating posts.",
  "frontend/src/components/ReelBottomTabNav.tsx": "Tab-style bottom navigation with active state highlighting, keyboard support, and a create-post modal trigger.",
  "frontend/src/components/ReelHome.tsx": "Empty placeholder component.",
  "frontend/src/components/SafeImageIcon.tsx": "Image component that falls back to an icon or text when the image fails to load.",
  "frontend/src/components/Search.tsx": "Search form with input and button that triggers a callback when a term is submitted.",
  "frontend/src/components/SearchWithSi.tsx": "Empty placeholder component.",
  "frontend/src/components/ServiceStatusChecker.tsx": "Checks backend service health via actor call, displays status, errors, and admin-only photo system details.",
  "frontend/src/components/SiAssistant.tsx": "Empty placeholder component.",
  "frontend/src/components/SkeletonBlog.tsx": "Skeleton loader showing placeholder layout for a blog card with header, content, and footer.",
  "frontend/src/components/SkeletonMarketplace.tsx": "Skeleton loader simulating a detailed marketplace item card with images, text, and actions.",
  "frontend/src/components/SkeletonPost.tsx": "Skeleton loader showing a simplified post layout with header, text, and image placeholder.",
  "frontend/src/components/Space.tsx": "Static page describing a space-themed environment with customization and atmosphere info cards.",
  "frontend/src/components/SpaceStarfield.tsx": "Empty placeholder component.",
  "frontend/src/components/SpaceThemeSettings.tsx": "Empty placeholder component.",
  "frontend/src/components/StarEffectLogo.tsx": "Canvas-based animated star effect rendered around a logo image using a particle system.",
  "frontend/src/components/StarlightBackground.tsx": "Empty placeholder component.",
  "frontend/src/components/StartLiveModal.tsx": "Modal that initializes camera/mic, lets users start or end a live session, and shows a live video preview with controls.",
  "frontend/src/components/StartupRecoveryScreen.tsx": "Recovery screen prompting users to clear cache and reload when the app is stuck or an update fails.",
  "frontend/src/components/StorageCleanup.tsx": "UI for running storage health checks and deep cleanup operations with progress feedback and result display.",
  "frontend/src/components/TalkToMeBar.tsx": "Empty placeholder component file.",
  "frontend/src/components/TopLevelErrorBoundary.tsx": "Error boundary that catches top-level React errors and shows a reload prompt with optional error details.",
  "frontend/src/components/TrendingSidebar.tsx": "Sidebar showing trending hashtags and top users derived from all posts.",
  "frontend/src/components/UpdateAvailableBanner.tsx": "Banner notifying users of an available update with options to update or perform full cache recovery if needed.",
  "frontend/src/components/UpdateStatusModal.tsx": "Modal for updating user status with text, image upload, and music attachment handling.",
  "frontend/src/components/UserProfileModal.tsx": "Displays a user's profile, posts, and follow info with modal UI and profile details.",
  "frontend/src/components/VideoModeReel.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/VideoReelCard.tsx": "Renders a video post card with autoplay, mute controls, author info, reactions, and modal profile view.",
  "frontend/src/components/WeatherBackground.tsx": "Canvas-based animated weather background rendering particles and gradients based on current conditions.",
  "frontend/src/components/WheelNavScroller.tsx": "Empty component file with no content.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides language selection and translation context with predefined translation dictionaries.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useDeedsUsage.ts": "Tracks session and daily usage time using localStorage and sessionStorage, updating periodically.",
  "frontend/src/hooks/useHorizontalWheelScroll.ts": "Converts vertical wheel scrolling to horizontal scrolling for a given element unless interacting with buttons or links.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for fetching and mutating user profiles, albums, music attachments, and status updates.",
  "frontend/src/hooks/useServiceWorkerUpdate.ts": "Detects service worker updates, handles activation, stale state checks, and guarded page reloads.",
  "frontend/src/hooks/useSpaceTheme.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useWeather.ts": "Fetches weather and sun cycle data based on geolocation, with fallbacks and periodic updates.",
  "frontend/src/hooks/useWheelScroller.ts": "Empty placeholder hook file.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode styles, and custom utility classes for UI effects.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/utils/swRecovery.ts": "Provides utilities to clear caches, unregister service workers, manage recovery cooldown state, and perform a full SW recovery with reload.",
  "frontend/src/utils/swReloadGuard.ts": "Tracks and limits service-worker-triggered reloads using a session reload counter.",
  "frontend/src/utils/urlParams.ts": "Handles reading URL parameters, persisting them in sessionStorage, and clearing them from URL/hash.",
  "frontend/src/utils/videoLayoutPersistence.ts": "Removes legacy video/reel layout keys from storage and can reload the app; also detects if legacy state exists.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, radii, and enabling plugins like typography and container queries.",
  "project_state.json": "Defines the project’s current rollback goals, feature restoration requirements, and pending requests."
}