{
  "kind": "build_request",
  "title": "Remove wheel navigation and replace with a simpler new navigation mechanic",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the wheel-based navigation mechanic from the app, including its UI, hooks, and styling, so no wheel navigation is rendered or referenced anywhere in the reel experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Delete the wheel and go back to something simple and not out yet create something new"
        ]
      },
      "acceptanceCriteria": [
        "WheelNavScroller is no longer imported or rendered (including on the ReelHome page and empty-feed state).",
        "The wheel-scroller hook is no longer used anywhere in the app.",
        "Wheel-specific CSS utilities/classes are removed or no longer referenced so they do not affect layout/behavior.",
        "The reel feed scroll behavior is not blocked by any remaining wheel event listeners."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a new simple, popular-feeling navigation mechanic (not a wheel) that is consistently available in the reel-first experience and is easy to use on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "go back to something simple",
          "create something new"
        ]
      },
      "acceptanceCriteria": [
        "A replacement navigation UI is available on the main reel route ('/'), providing one-tap access to core sections (Home/Reel, Discover, Create Post, Messages, Profile, Hub).",
        "Navigation supports mouse/touch and keyboard accessibility (tab focus + Enter/Space activation) with clear English labels/aria-labels.",
        "Create Post opens the existing create-post flow/modal (no broken navigation or dead buttons).",
        "The new navigation does not interfere with vertical scroll-snap usage on the reel feed."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the reel page and any related layout logic so the new navigation mechanic replaces the wheel without introducing duplicate/confusing navigation patterns.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Delete the wheel and go back to something simple"
        ]
      },
      "acceptanceCriteria": [
        "ReelHome uses the new navigation component instead of WheelNavScroller (including the empty-feed state).",
        "The navigation appears in a single, consistent place on the reel route (no duplicated wheel + bottom nav combinations).",
        "All navigation targets route correctly using the existing router paths ('/', '/discover', '/messages', '/profile', '/hub')."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply a coherent, distinct visual theme across the new navigation and reel experience that feels modern and addictive while staying simple (avoid blue/purple as the primary identity unless already present).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "something simple",
          "create something new"
        ]
      },
      "acceptanceCriteria": [
        "The navigation component has a consistent visual style (colors, typography, spacing, states) that matches the rest of the app.",
        "Active/selected state is clearly visible and accessible (sufficient contrast, not color-only).",
        "User-facing text in the new UI is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components); compose them instead.",
    "Do not edit immutable hook/entry files listed by the platform (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain single-actor (Motoko) and unchanged unless strictly required for navigation changes."
  ],
  "nonGoals": [
    "Do not add new backend features, schemas, or persistence to support the navigation change.",
    "Do not implement third-party auth or external integrations.",
    "Do not change existing route structure beyond what is necessary to swap the navigation UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}