{
  "kind": "build_request",
  "title": "Revert to old bottom navigation and restore Profile + Deeds features",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the previous primary navigation layout with the main icons fixed at the bottom of the screen (bottom tab navigation), replacing the current updated/high-tech icon navigation experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I hate it go back to the old version where the icons where at the bottom"
        ]
      },
      "acceptanceCriteria": [
        "On mobile and desktop widths, a fixed bottom navigation bar is visible with the main navigation icons.",
        "Bottom navigation includes clear access to: Home, Discover, Create, Messages, Profile, and Hub.",
        "Bottom navigation does not visually conflict with page content (main content has adequate bottom padding so it is not obscured).",
        "Navigation works via click/tap and uses the existing router paths (/, /discover, /messages, /profile, /hub) and opens the existing Create Post modal from the Create button."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore the Profile page experience from the prior version so the Profile route (/profile) works correctly and presents the expected profile content and actions (view/edit profile, posts, followers/following, notifications, etc.).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...and profile page..."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /profile renders the Profile page without runtime errors.",
        "Profile page supports the existing key sections/actions already present in the app (profile header, edit actions, followers/following modals, notifications panel, and user posts list) and they are reachable in the UI.",
        "Bottom navigation can navigate to /profile and shows the Profile tab as active when on /profile."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Restore the Deeds battery usage feature so users can see the DeedsBar battery-style session timer and daily usage limit UI as part of the user experience (as it was in the old version).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...and deeds battery usage feature..."
        ]
      },
      "acceptanceCriteria": [
        "A DeedsBar battery-style UI is visible to the user (at minimum on the Profile page) showing session time and a battery percentage indicator.",
        "Session timer updates in real time while the app is open.",
        "Daily usage value is not hard-coded to 0; it is tracked client-side (e.g., persisted per-day locally) so it can increase across a day and reset on a new day.",
        "Battery icon assets referenced by DeedsBar resolve correctly (no broken images)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Restore the Deeds report card feature (“Grade Deeds Report Card”) so it is accessible again as part of the app experience (as it was in the old version).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...and the deeds report card feature."
        ]
      },
      "acceptanceCriteria": [
        "The “Grade Deeds Report Card” UI renders (at minimum on the Profile page) without runtime errors.",
        "The report card shows the core metric sections and overall grade as visible UI content.",
        "If the UI includes a “Rate Friend” action, it opens a modal/dialog successfully and can be dismissed."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Keep backend as a single Motoko actor (backend/main.mo); only introduce migration.mo if persistent state needs to change."
  ],
  "nonGoals": [
    "Do not add new third-party authentication providers (only Internet Identity).",
    "Do not implement a new backend ratings system for the report card unless explicitly requested; restoring the existing UI/behavior is the goal.",
    "Do not introduce real-time/WebSocket functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}