{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Revert to classic bottom navigation and restore Profile + Deeds UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore classic fixed bottom tab navigation with the primary app destinations and Create Post modal trigger.",
      "acceptanceCriteria": [
        "On mobile and desktop widths, a fixed bottom navigation bar is visible with the main navigation icons.",
        "Bottom navigation includes clear access to: Home, Discover, Create, Messages, Profile, and Hub.",
        "Bottom navigation does not visually conflict with page content (main content has adequate bottom padding so it is not obscured).",
        "Navigation works via click/tap and uses the existing router paths (/, /discover, /messages, /profile, /hub) and opens the existing Create Post modal from the Create button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the bottom tab navigation into the shared app layout so it is fixed to the bottom across routes, and adjust the main content container to include adequate bottom padding to prevent content from being obscured."
        },
        {
          "path": "frontend/src/components/ReelBottomTabNav.tsx",
          "operation": "modify",
          "description": "Update the bottom tab navigation to derive its active state from the current router location (instead of local-only state) while preserving the existing Create Post modal trigger behavior."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure global styles support a fixed bottom navigation (e.g., consistent height, safe-area handling, and a reusable bottom padding utility/class that matches the nav height)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the /profile route renders the expected profile experience and key actions without runtime errors and with bottom-nav active state.",
      "acceptanceCriteria": [
        "Visiting /profile renders the Profile page without runtime errors.",
        "Profile page supports the existing key sections/actions already present in the app (profile header, edit actions, followers/following modals, notifications panel, and user posts list) and they are reachable in the UI.",
        "Bottom navigation can navigate to /profile and shows the Profile tab as active when on /profile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Profile.tsx",
          "operation": "modify",
          "description": "Restore/confirm the Profile page composition so the existing profile header/edit controls, followers/following modals, notifications panel, and posts list are reachable and stable; ensure it integrates cleanly with the restored bottom navigation without layout overlap."
        },
        {
          "path": "frontend/src/components/ReelBottomTabNav.tsx",
          "operation": "modify",
          "description": "Ensure the Profile tab correctly renders as active when the current route is /profile (route-aware active state)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Restore the DeedsBar battery-style session timer and daily usage UI with real-time updates and per-day local persistence.",
      "acceptanceCriteria": [
        "A DeedsBar battery-style UI is visible to the user (at minimum on the Profile page) showing session time and a battery percentage indicator.",
        "Session timer updates in real time while the app is open.",
        "Daily usage value is not hard-coded to 0; it is tracked client-side (e.g., persisted per-day locally) so it can increase across a day and reset on a new day.",
        "Battery icon assets referenced by DeedsBar resolve correctly (no broken images)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDeedsUsage.ts",
          "operation": "create",
          "description": "Implement a client-side usage tracking hook that provides real-time session duration and a per-day persisted daily usage counter (e.g., via localStorage keyed by date), including automatic reset on day rollover."
        },
        {
          "path": "frontend/src/components/Profile.tsx",
          "operation": "modify",
          "description": "Replace the hard-coded daily usage value and the current Deeds bar wiring with the restored battery-style DeedsBar fed by the new client-side usage tracking hook, so session and daily usage update in real time."
        },
        {
          "path": "frontend/src/components/DeedsBar.tsx",
          "operation": "modify",
          "description": "Harden DeedsBar asset rendering so battery/timer icons resolve reliably (e.g., use the existing SafeImageIcon fallback where appropriate and ensure paths align with assets under frontend/public/assets/generated), while keeping the battery-style UI and timers."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Restore the Grade Deeds Report Card UI so it renders and its Rate Friend modal works and is dismissible.",
      "acceptanceCriteria": [
        "The “Grade Deeds Report Card” UI renders (at minimum on the Profile page) without runtime errors.",
        "The report card shows the core metric sections and overall grade as visible UI content.",
        "If the UI includes a “Rate Friend” action, it opens a modal/dialog successfully and can be dismissed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Profile.tsx",
          "operation": "modify",
          "description": "Ensure GradeDeedsRating is rendered as part of the Profile experience (at minimum on /profile) with valid props, and that the entry point is visible and reachable within the page layout."
        },
        {
          "path": "frontend/src/components/GradeDeedsRating.tsx",
          "operation": "modify",
          "description": "Stabilize the Report Card modal open/close flow (Rate Friend action + dismiss) and ensure it renders without runtime errors using existing composed UI components (do not edit files under frontend/src/components/ui; compose them instead)."
        }
      ]
    }
  ]
}