{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace wheel navigation with a simple, accessible reel bottom navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove wheel navigation UI, hook usage, and wheel-specific styling so nothing wheel-related renders or intercepts scrolling in the reel experience.",
      "acceptanceCriteria": [
        "WheelNavScroller is no longer imported or rendered (including on the ReelHome page and empty-feed state).",
        "The wheel-scroller hook is no longer used anywhere in the app.",
        "Wheel-specific CSS utilities/classes are removed or no longer referenced so they do not affect layout/behavior.",
        "The reel feed scroll behavior is not blocked by any remaining wheel event listeners."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WheelNavScroller.tsx",
          "operation": "delete",
          "description": "Remove the WheelNavScroller component implementation so it can no longer be imported or rendered anywhere."
        },
        {
          "path": "frontend/src/hooks/useWheelScroller.ts",
          "operation": "delete",
          "description": "Remove the wheel-scroller hook to eliminate wheel event listeners and selection logic tied to the wheel navigation mechanic."
        },
        {
          "path": "frontend/src/components/ReelHome.tsx",
          "operation": "modify",
          "description": "Remove WheelNavScroller import and usages in both the empty-feed state and the main reel feed, ensuring no wheel navigation is rendered or referenced."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove wheel navigation utility/classes (e.g., wheel-nav-container, wheel-nav-item, wheel-nav-item-selected) so wheel styling no longer affects layout/behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a simple, popular-feeling bottom tab navigation on the reel route with accessible controls and Create Post integration.",
      "acceptanceCriteria": [
        "A replacement navigation UI is available on the main reel route ('/'), providing one-tap access to core sections (Home/Reel, Discover, Create Post, Messages, Profile, Hub).",
        "Navigation supports mouse/touch and keyboard accessibility (tab focus + Enter/Space activation) with clear English labels/aria-labels.",
        "Create Post opens the existing create-post flow/modal (no broken navigation or dead buttons).",
        "The new navigation does not interfere with vertical scroll-snap usage on the reel feed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReelBottomTabNav.tsx",
          "operation": "create",
          "description": "Create a new simple bottom tab navigation component for the reel-first experience (not a wheel). Use existing shadcn/ui components by composing (e.g., Button, dialog/modal triggers) and lucide icons; include clear English labels and aria-labels, keyboard activation (Enter/Space), and a Create Post trigger that opens the existing CreatePostModal. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ReelHome.tsx",
          "operation": "modify",
          "description": "Wire the new ReelBottomTabNav into the reel route so it is consistently available on '/'. Ensure it is positioned in a fixed, non-scroll-blocking way that does not interfere with the reel vertical scroll-snap."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the reel page layout to use only the new navigation component (no wheel/duplicate patterns) and ensure all targets route correctly.",
      "acceptanceCriteria": [
        "ReelHome uses the new navigation component instead of WheelNavScroller (including the empty-feed state).",
        "The navigation appears in a single, consistent place on the reel route (no duplicated wheel + bottom nav combinations).",
        "All navigation targets route correctly using the existing router paths ('/', '/discover', '/messages', '/profile', '/hub')."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReelHome.tsx",
          "operation": "modify",
          "description": "Ensure ReelHome renders exactly one navigation pattern on the reel route by using the new ReelBottomTabNav in both loaded and empty states, and removing any remaining wheel/bottom-nav duplication."
        },
        {
          "path": "frontend/src/components/ReelBottomTabNav.tsx",
          "operation": "modify",
          "description": "Implement navigation actions using the existing TanStack Router paths ('/', '/discover', '/messages', '/profile', '/hub') and keep Create Post opening the existing CreatePostModal. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply a coherent modern theme to the new navigation and reel experience with clear active states and English UI text (avoid blue/purple as primary identity).",
      "acceptanceCriteria": [
        "The navigation component has a consistent visual style (colors, typography, spacing, states) that matches the rest of the app.",
        "Active/selected state is clearly visible and accessible (sufficient contrast, not color-only).",
        "User-facing text in the new UI is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust lightweight utility classes for the new bottom navigation (container background, blur, borders, safe-area padding, focus-visible ring, and an active state that is not color-only, e.g., shape/underline). Ensure the style aligns with the existing red-forward primary tokens and avoids blue/purple as the primary identity."
        },
        {
          "path": "frontend/src/components/ReelBottomTabNav.tsx",
          "operation": "modify",
          "description": "Apply the updated theme styling classes and ensure active state is both visually distinct and accessible (contrast + non-color cue), while keeping all user-facing labels in English. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}